backend/test/loadtest.yaml
config:
  # target: "ws://127.0.0.1:8080"
  target: "wss://voting-socket.rumpus.club"
  phases:
    - duration: 20
      arrivalCount: 50
    - duration: 20
      arrivalCount: 100
    - duration: 20
      arrivalCount: 200
    - duration: 20
      arrivalCount: 400

scenarios:
  - engine: "ws"
    flow:
      - loop:
        - send:
            code: "vote"
            data: "{{ $randomNumber(0, 3) }}"
            userId: "{{ $randomString() }}"
        - think: 1
        count: 5